def f():
    import pyfiglet
    resi=pyfiglet.figlet_format('LABA-6', font="banner3-d")
    print(resi)
###::::::::::'###::::'########:::::'###::::::::::::::'#######::
 ##:::::::::'## ##::: ##.... ##:::'## ##::::::::::::'##.... ##:
 ##::::::::'##:. ##:: ##:::: ##::'##:. ##::::::::::: ##::::..::
 ##:::::::'##:::. ##: ########::'##:::. ##:'#######: ########::
 ##::::::: #########: ##.... ##: #########:........: ##.... ##:
 ##::::::: ##.... ##: ##:::: ##: ##.... ##:::::::::: ##:::: ##:
 ########: ##:::: ##: ########:: ##:::: ##::::::::::. #######::
#.......::..:::::..::........:::..:::::..::::::::::::.......:::
def o():
    countrees_and_cities={
                          'Russia' :'Moscow',
                          'America':'Boston',
                          'netherlands':'amsterdam'
    }
    #Выведите на экран все пары ключ-значение.
    #b)Выведите на экран столицу для определенной страны.
    #c)Отсортируйте и выведите на экран содержимое словаря в алфавитном порядке названий стран.
    print("A -",*countrees_and_cities.keys())
    print("B -",countrees_and_cities['America'])
    print("C -",*sorted(countrees_and_cities))\
#Эрудит
def s():
    spisok_ochkov = {
        'А': 1, 'Б': 3, 'В': 1, 'Г': 3, 'Д': 2, 'Е': 1, 'Ё': 3, 'Ж': 5,
        'З': 5, 'И': 1, 'Й': 4, 'К': 2, 'Л': 2, 'М': 2, 'Н': 1, 'О': 1,
        'П': 2, 'Р': 1, 'С': 1, 'Т': 1, 'У': 2, 'Ф': 10, 'Х': 5, 'Ц': 5,
        'Ч': 5, 'Ш': 8, 'Щ': 10, 'Ъ': 10, 'Ы': 4, 'Ь': 3, 'Э': 8, 'Ю': 8,
        'Я': 3
    }
    put = input("Игра Эрудит. Введите слово - ").upper()
    points = 0
    for letter in put:
        points += spisok_ochkov.get(letter, 0)
    print("Слово",put,"стоит",points,"очков.")
def t():
    students = {
        'Иванов': {'английский', 'немецкий', 'французский'},
        'Петров': {'английский', 'китайский', 'испанский'},
        'Сидоров': {'немецкий', 'испанский', 'итальянский'},
        'Смирнова': {'французский', 'китайский'}
    }
    languages=set()
    for student in students:
        languages.update(students[student])
    chinese_speakers = [student for student in students if 'китайский' in students[student]]
    print('Имена людей которые знают китайский -',", ".join(chinese_speakers))
    print("Все языки которые знают студенты -",*languages)